app/controllers/guests_controller.rb

    def index
      @guest = Guest.search(params[:search])
      if @guest.present?
---
SELECT "guests".* FROM "guests" WHERE (unaccent(fullname) LIKE unaccent('%Martha%'))

    def edit
      @guest = Guest.find(params[:id])
      @scort_guests = ScortGuest.where(guest_id: params[:id])
---
SELECT "guests".* FROM "guests" WHERE "guests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "scort_guests".* FROM "scort_guests" WHERE "scort_guests"."guest_id" = $1  [["guest_id", 2]]

    def update
      cedula_guest = guest_params[:guest_id]
      email = guest_params[:email]
      if cedula_guest.present?
        respond_to do |format|
          if @guest.update(id_guest: cedula_guest, email: email, confirmation: 1)
            if guest_params[:scort_guests].present?
              @scorts_objs = []
              guest_params[:scort_guests].each do |scort|
                cedula_scort= scort[1]["id_scort"]
                if cedula_scort.present?
                  @scort_guests = ScortGuest.find(scort[0])
                  @scort_guests.update(id_scort: scort[1]["id_scort"], confirmation: 1)
---
UPDATE "guests" SET "id_guest" = $1, "email" = $2, "updated_at" = $3, "confirmation" = $4 WHERE "guests"."id" = $5  [["id_guest", "5635"], ["email", "paomg.9614@gmail.com"], ["updated_at", "2021-04-06 00:15:57.082863"], ["confirmation", 1], ["id", 2]]
SELECT "guests".* FROM "guests" WHERE "guests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "scort_guests".* FROM "scort_guests" WHERE "scort_guests"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "scort_guests" SET "id_scort" = $1, "updated_at" = $2, "confirmation" = $3 WHERE "scort_guests"."id" = $4  [["id_scort", "5434"], ["updated_at", "2021-04-06 00:15:57.581270"], ["confirmation", 1], ["id", 5]]

      def set_guest
        @guest = Guest.find(params[:id])
---
SELECT "guests".* FROM "guests" WHERE "guests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]